//Завдання
//Через скільки після запуску нашого таймера буде зявлятись реклама,
// а через скільки зниккати?

// В css всановлюєм дісплей none ( щоб не видно було)
// Вказуємо банальний інтервал на 5000ms - setTimeout(() => {}, 5000);
// Перше всього застосовуєм інлайновий стиль і вказуємо display  block, щоб через 5000мс зявлявся лічильник
// Після того як відпрацюв setTimeout(він відпрацьовує один раз і видаляється сам по собі) потрібно зробити якійсь інтервал
//через скільки в нас закриється данна реклама
// Нам потрібно створити відлік часу 10..9..8..
// В setInterval мені потрібно кожного разу відмальовувати значення секунд
//Відповідно інтервал треба викликати кожну секунду
// Тепер мені потрібен titleTimer , в ньому треба змінювати textContent на counter
// Оголошуємо let counter = 11( завжди на один  шаг більше чим потрібно)

// setInterval потрібно зупиняти на відміну від setTimeout.
// Створюємо ідентифікатор id , та присвоємо йому результат роботи setInterval
// Потім нам треба сказати якщо значення менше 0 , то ми прибирвємо данний інтервал
// то що дав нам setInterval, то і прибираєм - clearInterval(id)
// Після чого банально додаємо box.style.display = 'none';

const box = document.querySelector(".js-box");
const titleTimer = document.querySelector(".js-timer");

let counter = 11;
setTimeout(() => {
  box.style.display = "block";
  const id = setInterval(() => {
    counter -= 1;
    titleTimer.textContent = counter;
    if (!counter) {
      clearInterval(id);
      box.style.display = "none";
    }
  }, 1000);
}, 5000);
